// C 三羊献瑞
// 题目描述：

//      祥 瑞 生 辉
//   +  三 羊 献 瑞
// -------------------
//   三 羊 生 瑞 气
// 结果：
// 三 羊  生 瑞 气 辉 祥
// 1  2  3  4  5  6  7
// 不同的汉字代表不同的数字。请你填写“三羊献瑞”所代表的4位数字（答案唯一），不要填写任何多余内容
// 换算：
//       e d f g
//   +   a b c d
// -------------------
//     a b f d h
// 和：
//       aa[4] aa[3] aa[5] aa[6]
//   +   aa[0] aa[1] aa[2] aa[3]
// -------------------------------
// aa[0] aa[1] aa[5] aa[3] aa[7]
// 每个汉字对应的数字都是不同的
// a~h8个字母（数组元素）的取值范围是从0到9十个数字，a(aa[0])!=0&&e(aa[4])!=0
#include <stdio.h>

int main() {
    int sum, sum1, sum2;
    for(int a = 1; a <= 9; ++a) { // a 不能等于 0 
        for(int b = 0; b <= 9; ++b) {
            if(b != a) {
                for(int c = 0; c <= 9; ++c) {
                    if(c != a && c != b) {
                        for(int d = 0; d <= 9; ++d) {
                            if(d != a && d != b && d != c) {
                                for(int e = 1; e <= 9; ++e) { // e 不能等于 0 
                                    if(e != a && e != b && e != c && e != d) {
                                        for(int f = 0; f <= 9; ++f) {
                                            if(f != a && f != b && f != c && f != d && f != e) {
                                                for(int g = 0; g <= 9; ++g) {
                                                    if(g != a && g != b && g != c && g != d && g != e && g != f) {
                                                        for(int h = 0; h <= 9; ++h) {
                                                            if(h != a && h != b && h != c && h != d && h != e && h != f && h != g) {
                                                                sum1 = e * 1000 + d * 100 + f * 10 + g;
                                                                sum2 = a * 1000 + b * 100 + c * 10 + d;
                                                                sum = a * 10000 + b * 1000 + f * 100 + d * 10 + h;
                                                                if(sum == (sum1 + sum2)) {
                                                                    printf("%d\n", sum2);
                                                                }
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
    return 0;
}