//
// Created by 大妖怪 on 2024/1/30.
//
//P5731【深基5.习6】蛇形方阵
// 题目描述
// 给出一个不大于 9 的正整数 n，输出 n * n的蛇形方阵。
// 从左上角填上 1 开始，顺时针方向依次填入数字，如同样例所示。注意每个数字有都会占用 3 个字符，前面使用空格补齐。
// 输入格式
// 输入一个正整数 n，含义如题所述。
// 输出格式
// 输出符合题目要求的蛇形矩阵。
// 样例输入
// 4
// 样例输出
// 1  2  3  4
// 12 13 14  5
// 11 16 15  6
// 10  9  8  7
// 提示
// 数据保证，1 <= n <= 9。
// 1.从左到右
// 2.从上到下
// 3.从右到左
// 4.从下到上
#include <stdio.h>
const int N = 15;

int main() {
    int a[N][N] = {0};
    int n;
    scanf("%d", &n);
    int k = 1;
    int x = 1, y = 0;
    while(k <= n * n) {
        while(y < n && !a[x][y + 1])    a[x][++y] = k ++;// 从左到右
        while(x < n && !a[x + 1][y])    a[++x][y] = k ++;// 从上到下
        while(y > 1 && !a[x][y - 1])    a[x][--y] = k ++;// 从右到左
        while(x > 1 && !a[x - 1][y])    a[--x][y] = k ++;// 从下到上
    }

    for(int i = 1; i <= n; ++i) {
        for(int j = 1; j <= n; ++j) {
            printf("%3d", a[i][j]);
        }
        printf("\n");
    }

    return 0;
}